{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicyTemplates('4cfd164c-5e8a-4ea9-b15d-9aa71e4ffff4_1')/settingTemplates",
  "@odata.count": 24,
  "value": [
    {
      "id": "1",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "ad8554ce-16d5-44a5-9686-d286844755b0",
        "settingDefinitionId": "linux_mdatp_managed_cloudservice_enabled",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "f43ea7cb-baa1-4c05-87a7-b11e0c94becc"
        }
      }
    },
    {
      "id": "2",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "53041276-320f-4218-8ad6-c722da38c3b8",
        "settingDefinitionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "e0d01c97-88a2-4c0b-acf0-4e22334012e4"
        }
      }
    },
    {
      "id": "3",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "94284249-9ac1-4f5f-95f9-6660763f495e",
        "settingDefinitionId": "linux_mdatp_managed_cloudservice_diagnosticlevel",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "222df582-4c28-453e-85a0-8932d4747034"
        }
      }
    },
    {
      "id": "4",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "5a10dd94-e9ea-439c-8d2d-daf2a5af942f",
        "settingDefinitionId": "linux_mdatp_managed_cloudservice_automaticdefinitionupdateenabled",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "695c7907-d2e1-4950-8cb2-e3607f0d3f77"
        }
      }
    },
    {
      "id": "5",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "ecc10436-d18f-43cb-801e-6f484abe9695",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_enablerealtimeprotection",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "2242c6fa-1d09-4904-82db-82a728a1381a"
        }
      }
    },
    {
      "id": "6",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "0cf58d5e-fbb7-4dc5-ad83-484246c3108a",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_passivemode",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "c4ff0f10-e4f8-4727-a7af-e5292a1695ef"
        }
      }
    },
    {
      "id": "7",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstanceTemplate",
        "settingInstanceTemplateId": "4c481aaf-eec5-4d3d-b1bf-6538b91e3c3f",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_scanhistorymaximumitems",
        "isRequired": false,
        "simpleSettingValueTemplate": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueTemplate",
          "settingValueTemplateId": "e69df259-3312-41bf-a1e3-e4caf5f09672",
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null
        }
      }
    },
    {
      "id": "8",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstanceTemplate",
        "settingInstanceTemplateId": "bc3a38fc-9ea5-4986-8453-3ae84122273b",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_scanresultsretentiondays",
        "isRequired": false,
        "simpleSettingValueTemplate": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueTemplate",
          "settingValueTemplateId": "5310768d-c4d6-48d5-aad3-adb07e958345",
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null
        }
      }
    },
    {
      "id": "9",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "a3bedec3-1d7e-4bfc-a39b-74797c1cfb32",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_exclusionsmergepolicy",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "f76cec1a-9350-4e56-8478-9c0d2229dbf9"
        }
      }
    },
    {
      "id": "10",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstanceTemplate",
        "settingInstanceTemplateId": "e2d557ab-357e-4727-978e-0d655facbb23",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions",
        "isRequired": false,
        "allowUnmanagedValues": true,
        "groupSettingCollectionValueTemplate": [
          {
            "settingValueTemplateId": "8098dca8-98b9-4c09-a73e-0fee5ea7cca9",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
                "settingInstanceTemplateId": "1a3b8adc-6825-4556-a04e-b17d8dc0c4fb",
                "settingDefinitionId": "linux_mdatp_managed_antivirusengine_exclusions_item_$type",
                "isRequired": false,
                "choiceSettingValueTemplate": {
                  "defaultValue": null,
                  "recommendedValueDefinition": null,
                  "requiredValueDefinition": null,
                  "settingValueTemplateId": "7904400e-d08c-4b7c-bac8-780387a6394d"
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "11",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstanceTemplate",
        "settingInstanceTemplateId": "2e407734-2d3a-4cc2-9a81-4d1c54718096",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings",
        "isRequired": false,
        "allowUnmanagedValues": true,
        "groupSettingCollectionValueTemplate": [
          {
            "settingValueTemplateId": "03160bfa-e9db-4dd5-a50b-d6a89624a1b9",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
                "settingInstanceTemplateId": "e639a747-d49e-49ac-a93b-cec8fcb1d747",
                "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value",
                "isRequired": false,
                "choiceSettingValueTemplate": {
                  "defaultValue": null,
                  "recommendedValueDefinition": null,
                  "requiredValueDefinition": null,
                  "settingValueTemplateId": "0c4f59ce-56ad-420c-bb5c-ad9beabce574"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
                "settingInstanceTemplateId": "f6f8e649-43e8-4c00-b0be-7b5aec9cc96b",
                "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
                "isRequired": false,
                "choiceSettingValueTemplate": {
                  "defaultValue": null,
                  "recommendedValueDefinition": null,
                  "requiredValueDefinition": null,
                  "settingValueTemplateId": "7bcb7b41-778c-4fbd-812d-391bbf27de5d"
                }
              }
            ]
          },
          {
            "settingValueTemplateId": "70f39a05-d4d7-47be-afa8-26c4cdf014f8",
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
                "settingInstanceTemplateId": "970928e2-2293-4c5a-b1ab-1fe699f4a0f9",
                "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_value",
                "isRequired": false,
                "choiceSettingValueTemplate": {
                  "defaultValue": null,
                  "recommendedValueDefinition": null,
                  "requiredValueDefinition": null,
                  "settingValueTemplateId": "0fee281d-85eb-4844-96a2-378c5ecd195a"
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
                "settingInstanceTemplateId": "40d2d7e0-79fa-4b94-8eb9-35d2aac10771",
                "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettings_item_key",
                "isRequired": false,
                "choiceSettingValueTemplate": {
                  "defaultValue": null,
                  "recommendedValueDefinition": null,
                  "requiredValueDefinition": null,
                  "settingValueTemplateId": "acf49530-de9d-4d4b-b9fc-e215e1e18adc"
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "12",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "a8d21df4-18c9-4441-bab1-0dc8ad0aa4e7",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_threattypesettingsmergepolicy",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "d016b769-202c-40a4-bffa-ddb53f9287fb"
        }
      }
    },
    {
      "id": "13",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstanceTemplate",
        "settingInstanceTemplateId": "7a571d8f-6116-4022-a0f8-4714b476ebce",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_allowedthreats",
        "isRequired": false,
        "allowUnmanagedValues": true,
        "simpleSettingCollectionValueTemplate": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueTemplate",
            "settingValueTemplateId": "1b335735-33c9-41c1-8680-1134150d194f",
            "defaultValue": null
          }
        ]
      }
    },
    {
      "id": "14",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstanceTemplate",
        "settingInstanceTemplateId": "d1673a55-f037-4eca-b037-89392341d1b8",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_disallowedthreatactions",
        "isRequired": false,
        "allowUnmanagedValues": true,
        "simpleSettingCollectionValueTemplate": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueTemplate",
            "settingValueTemplateId": "8ba3cfe6-d411-46b8-a990-a8ee83d1e4b6",
            "defaultValue": null
          }
        ]
      }
    },
    {
      "id": "15",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "c10d108c-791b-466d-a644-496ffb91ad4e",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_scanarchives",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "bec9915b-f42e-43c0-91c5-31eec7477174"
        }
      }
    },
    {
      "id": "16",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "5b971075-325b-4082-829f-7dc3b024a287",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_scanafterdefinitionupdate",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "7b98572e-b14b-47b6-b564-0d22dd730fcf"
        }
      }
    },
    {
      "id": "17",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "cb7adfaa-20d9-4125-ad34-a4e2fb7d3c28",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_enablefilehashcomputation",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "cba77fe5-f9c7-42a9-bbef-78cd29eaf1ab"
        }
      }
    },
    {
      "id": "18",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "5a28a1d5-cb9f-4e49-8a65-fbe480f848b1",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_behaviormonitoring",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "56268401-a42d-4340-863b-cec0a2d2f967"
        }
      }
    },
    {
      "id": "19",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "03ade319-3e8a-4cfc-af8f-962b247c948c",
        "settingDefinitionId": "linux_mdatp_managed_cloudservice_cloudblocklevel",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "c467c7e3-fc63-421a-89fa-311efdf99c11"
        }
      }
    },
    {
      "id": "20",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstanceTemplate",
        "settingInstanceTemplateId": "fa93a439-71a8-4115-bd38-05be9472b19d",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_maximumondemandscanthreads",
        "isRequired": false,
        "simpleSettingValueTemplate": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValueTemplate",
          "settingValueTemplateId": "293faa0a-0730-4216-a925-59ad644d4969",
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null
        }
      }
    },
    {
      "id": "21",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "57282368-36da-46e8-b835-569cfc010928",
        "settingDefinitionId": "linux_mdatp_managed_networkprotection_enforcementlevel",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "b2b9fddb-c0c4-4a56-bcae-534c93d49b76"
        }
      }
    },
    {
      "id": "22",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstanceTemplate",
        "settingInstanceTemplateId": "43518e88-fb20-4d63-b4d1-6683aa64b65a",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_unmonitoredfilesystems",
        "isRequired": false,
        "allowUnmanagedValues": true,
        "simpleSettingCollectionValueTemplate": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueTemplate",
            "settingValueTemplateId": "33213f6e-ef8b-4a04-8849-95887c5522e8",
            "defaultValue": null
          }
        ]
      }
    },
    {
      "id": "23",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "876336dd-093a-41f2-9497-e6293479c72c",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_nonexecmountpolicy",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "65939d65-ff28-46d9-82bb-7aea489ad4d7"
        }
      }
    },
    {
      "id": "24",
      "settingInstanceTemplate": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstanceTemplate",
        "settingInstanceTemplateId": "2c5e7db8-5f1f-4e80-91c4-25cdc0841410",
        "settingDefinitionId": "linux_mdatp_managed_antivirusengine_enforcementlevel",
        "isRequired": false,
        "choiceSettingValueTemplate": {
          "defaultValue": null,
          "recommendedValueDefinition": null,
          "requiredValueDefinition": null,
          "settingValueTemplateId": "82914380-18f6-4c77-9ffd-9758a48bd0a7"
        }
      }
    }
  ]
}