{
    "name": "Github Demo Action Aug 7 2024 2108",
    "description": "",
    "creationSource": null,
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "f43ea7cb-baa1-4c05-87a7-b11e0c94becc"
                    },
                    "value": "linux_mdatp_managed_cloudservice_enabled_true"
                },
                "settingDefinitionId": "linux_mdatp_managed_cloudservice_enabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ad8554ce-16d5-44a5-9686-d286844755b0"
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e0d01c97-88a2-4c0b-acf0-4e22334012e4"
                    },
                    "value": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent_safe"
                },
                "settingDefinitionId": "linux_mdatp_managed_cloudservice_automaticsamplesubmissionconsent",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "53041276-320f-4218-8ad6-c722da38c3b8"
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "222df582-4c28-453e-85a0-8932d4747034"
                    },
                    "value": "linux_mdatp_managed_cloudservice_diagnosticlevel_0"
                },
                "settingDefinitionId": "linux_mdatp_managed_cloudservice_diagnosticlevel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "94284249-9ac1-4f5f-95f9-6660763f495e"
                }
            }
        }
    ],
    "roleScopeTagIds": [
        "0"
    ],
    "platforms": "linux",
    "technologies": "microsoftSense",
    "templateReference": {
        "templateId": "4cfd164c-5e8a-4ea9-b15d-9aa71e4ffff4_1"
    }
}