{
  "name": "Mac Baseline AV",
  "description": "",
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7ea0a2aa-0953-4340-b590-522f040b0da3"
          },
          "value": "com.apple.managedclient.preferences_enabled_true"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_enabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "9e424cc6-35b9-48ef-863c-73295aa9d2d7"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "de57abd5-1a87-463e-96e7-e117524003ba"
          },
          "value": "com.apple.managedclient.preferences_automaticsamplesubmission_true"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_automaticsamplesubmission",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d5563bad-08c5-47de-8bbb-5d44e0f9a23a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "112fd4a8-1393-49b6-9569-0d37266a6ad3"
          },
          "value": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled_true"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_automaticdefinitionupdateenabled",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "cc18c6dc-dca5-4845-9c78-c718c9447ddd"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "26bb4b38-6e8a-4e3d-9045-81314475b3fe"
          },
          "value": "com.apple.managedclient.preferences_scanarchives_true"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_scanarchives",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "27ca9434-85a0-4175-999d-bbef8eb8d066"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "96ced765-4f68-441a-b9ad-b683cfdfa28f"
          },
          "value": "com.apple.managedclient.preferences_enforcementlevel_2"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "94f6f35c-4cee-4a61-930a-491b698c790a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "440003a2-8406-47bb-a785-a45869556ead"
          },
          "value": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine_2"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_antivirusengine",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a1bf7f4c-196e-4930-8395-a9b496433322"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "6e25fd09-16f1-42fd-9ffe-954ee1c0b904"
          },
          "value": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection_2"
        },
        "settingDefinitionId": "com.apple.managedclient.preferences_enforcementlevel_tamperprotection",
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3c4efab3-cf91-4540-b86d-54507c90bb4b"
        }
      }
    }
  ],
  "roleScopeTagIds": [
    "0"
  ],
  "platforms": "macOS",
  "technologies": "mdm,microsoftSense",
  "templateReference": {
    "templateId": "2d345ec2-c817-49e5-9156-3ed416dc972a_1"
  }
}