{
    "name": "Sample Update Policy",
    "description": "",
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "afc8df70-7b19-4335-b200-bf4b7e098f67"
                    },
                    "value": "device_vendor_msft_defender_configuration_engineupdateschannel_5"
                },
                "settingDefinitionId": "device_vendor_msft_defender_configuration_engineupdateschannel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f7e1409d-9c85-4a3f-85a6-ad05cc8ccf13"
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "d3b0d61a-bdc5-4507-84d0-5f2a4a3e11a5"
                    },
                    "value": "device_vendor_msft_defender_configuration_platformupdateschannel_5"
                },
                "settingDefinitionId": "device_vendor_msft_defender_configuration_platformupdateschannel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "e78b3ace-75d0-4aad-b3fa-4f49390d6483"
                }
            }
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "choiceSettingValue": {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                    "children": [],
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "41ea06bf-e94a-482a-9aaa-7fd535fb4150"
                    },
                    "value": "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel_5"
                },
                "settingDefinitionId": "device_vendor_msft_defender_configuration_securityintelligenceupdateschannel",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ba273649-e186-4377-89d5-87405bc9a87c"
                }
            }
        }
    ],
    "roleScopeTagIds": [
        "0"
    ],
    "platforms": "windows10",
    "technologies": "mdm,microsoftSense",
    "templateReference": {
        "templateId": "e3f74c5a-a6de-411d-aef6-eb15628f3a0a_1"
    }
}