{
    "name": "Windows Baseline AV",
    "description": "",
    "settings": [
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0"
            },
            "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1"
            },
            "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c"
            },
            "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e"
            },
            "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12"
            },
            "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a"
            },
            "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d"
            },
            "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a"
            },
            "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45"
            },
            "value": "device_vendor_msft_policy_config_defender_puaprotection_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "6b4e3497-cfbb-4761-a152-de935bbf3f07"
            },
            "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ed077fee-9803-44f3-b045-aab34d8e6d52"
            },
            "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1"
          },
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "afbc322b-083c-4281-8242-ebbb91398b41"
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "248fdbe0-e0c9-4b47-bce1-95c8058736fb"
            },
            "value": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel_1"
          },
          "settingDefinitionId": "device_vendor_msft_defender_configuration_allownetworkprotectiondownlevel",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d7342aaf-833d-4afc-92d6-e9621256a3cc"
          }
        }
      },
      {
        "id": "12",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f61c2788-14e4-4e80-a5a7-bf2ff5052f63"
          },
          "simpleSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
            "value": 50,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "608f1561-b603-46bd-bf5f-0b9872002f75",
              "useTemplateDefault": false
            }
          }
        }
      },
      {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
          "choiceSettingValue": {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "children": [],
            "settingValueTemplateReference": {
              "settingValueTemplateId": "3a9774b2-3143-47eb-bbca-d73c0ace2b7e"
            },
            "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_1"
          },
          "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "5f9a9c65-dea7-4987-a5f5-b28cfd9762ba"
          }
        }
      },
      {
        "id": "14",
        "settingInstance": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f6394bc5-6486-4728-b510-555f5c161f2b"
          },
          "groupSettingCollectionValue": [
            {
              "settingValueTemplateReference": null,
              "children": [
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats",
                  "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "dfa69081-2b32-4c6c-9370-fa380679a0be"
                  },
                  "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_severethreats_quarantine",
                    "settingValueTemplateReference": {
                      "settingValueTemplateId": "4e3a8f33-ed8b-459e-b9e5-70fbeb5f1abf",
                      "useTemplateDefault": false
                    },
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_moderateseveritythreats_quarantine",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_lowseveritythreats_quarantine",
                    "children": []
                  }
                },
                {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                  "settingDefinitionId": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats",
                  "settingInstanceTemplateReference": null,
                  "choiceSettingValue": {
                    "settingValueTemplateReference": null,
                    "value": "device_vendor_msft_policy_config_defender_threatseveritydefaultaction_highseveritythreats_quarantine",
                    "children": []
                  }
                }
              ]
            }
          ]
        }
      }
    ],
    "roleScopeTagIds": [
      "0"
    ],
    "platforms": "windows10",
    "technologies": "mdm,microsoftSense",
    "templateReference": {
      "templateId": "804339ad-1553-4478-a742-138fb5807418_1"
    }
  }